# ExportPatternKey Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportPatternKey Constructor
ExportPatternKey Class See Also
---
Constructs a new default ExportPatternKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportPatternKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportPatternKey()
```

# See Also
ExportPatternKey Class
ExportPatternKey Overload
Autodesk.Revit.DB Namespace